Change diagram
